print("Yesterday review")
"""
一.昨日内容回顾
    函数:对功能或动作的封装
    语法:
        def 函数名(形参列表)
            函数体(代码块,return)
        函数名(实参列表)
    形参  实参    传值
    返回值:
        return 可以终止一个函数的运行
        1.什么都不写,不写return,返回none
        2.写了 return,返回none
        3.return 值,返回一个返回值
        4.return 值1,值2,值3...多个返回值.接收的是元组(元组不可变)
    参数:
            形参:
                1.位置参数
                2.,默认值参数
                3.动态传参
            实参:
                1.位置参数,记住位置
                2.关键字参数,记住名字
                3.混合参数,顺序:先位置后关键字
二.作业讲解
三.今日主要内容
    1.函数的动态参数
    2.命名空间
    3.函数嵌套和作用域
    4.global和nonlocal关键字
"""